
var labelMatcher =  "\\#\\# 系统环境\\(必填\\[多选\\]\\)"
const reg = new RegExp(`(?<=${labelMatcher}(\\s+|\\n+)\\+?)((\\n+?|\\s+?)?-\\s+?\\[[\\s+x]\\]\\s+[\\u4e00-\\u9fa5_a-zA-Z0-9_\\(.\\-\\/\\)].+)+`, 'gm')


console.log('reg', reg);
// 错误：/(?<=\#\# 系统环境\(必填\[多选\]\)(\s+|\n+)\+?)((\n+?|\s+?)?-\s+?\[[\s+x]\]\s+[\u4e00-\u9fa5_a-zA-Z0-9_\(.\-\/\)].+)+/gm
// 正确：/(?<=\#\# 系统环境\(必填\[多选\]\)(\s+|\n+)\+?)((\n+?|\s+?)?-\s+?\[[\s+x]\]\s+[\u4e00-\u9fa5_a-zA-Z0-9_\(.\-\/\)].+)+/gm

var a = `## 系统环境(必填[多选])
- [x] IOS
- [x] Android
- [x] IDE

## 问题模块(必填[单选])
- [ ] 小程序框架
- [ ] 小程序Api
- [ ] 小程序基础组件
- [ ] 小程序开发者工具(IDE)
- [ ] 小程序容器(iOS)
- [ ] 小程序容器(Android)
- [ ] 小程序服务(服务后台)
- [ ] 小程序服务(文档平台)
- [ ] 小程序业务(需求/支付/服务号)

## 服务商名称(必填[单选]) - 排名不分先后
- [ ] 有赞
- [ ] 微盟
- [ ] 直客通
- [ ] 民宿宝
- [ ] 订单来了
- [ ] 太目
- [x] 其他(自开发)

## 基础库版本或小红书APP版本(必填)
v7.45.1

## 重现步骤 和 复现问题的最小demo Github链接
例如：//cdn2.xxx.com/xxxxxx.jpg

## 期望结果 和 实际结果(必填)
正常加载出资源

## 补充(猜测可能的原因是什么，你有啥想法，选填)
    `.match(reg)

    console.log('a', a)